# BottomFlangeLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralLZ..::..BottomFlangeLength Property
StructuralSectionGeneralLZ Class See Also
---
Bottom Flange segment length.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double BottomFlangeLength { get; set; }
```

Visual Basic
---
```text
Public Property BottomFlangeLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BottomFlangeLength {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionGeneralLZ Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace